testdata/ExhaustINVLAN.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
   </soapenv:Header>
   <soapenv:Body>
      <com:queryRequest xmlns:com="http://ossj.org/xml/Common/v1-5" xmlns:nccom="http://netcracker.com/xsd/applications/ossj/Common/v1-5" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
         <com:namedQuery xsi:type="nccom:DynamicNamedQuery">
            <nccom:queryIdentifier>Param1</nccom:queryIdentifier>
            <nccom:queryParameters>
               <ethernetNetworkName>Param2</ethernetNetworkName>
            	<poolName>Param3</poolName>
            	<accountNumber>ACCT_NUM</accountNumber>
           </nccom:queryParameters>
         </com:namedQuery>
      </com:queryRequest>
   </soapenv:Body>
</soapenv:Envelope>